---
kind: property
id: P:Autodesk.Revit.DB.ParameterTypeId.TrussFamilyTopChordVerticalProjectionParam
source: html/c78b882a-c0d4-07b8-0f85-ec9e3c933a26.htm
---
# Autodesk.Revit.DB.ParameterTypeId.TrussFamilyTopChordVerticalProjectionParam Property

"Analytical Vertical Projection"

## Syntax (C#)
```csharp
public static ForgeTypeId TrussFamilyTopChordVerticalProjectionParam { get; }
```